## Data Control

In [ ]:
import pandas as pd

In [1]:
import numpy as np

#### 데이터 불러오기

In [2]:
csData = pd.read_csv("../dataset/customerdata.csv")
csData.head(5)

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
1  A14219   3642.441950    2          4.0    2.682023      Sleeping-dog
2  A15312   3653.884565    2          5.0    3.208202      Sleeping-dog
3  A16605   3713.211107    2          6.6    0.900000        Early-bird
4  B10634   3391.074215    2          4.2    2.453656      Sleeping-dog

#### 원하는 데이터만 조회하기

In [22]:
# 데이터프레임[조건]

csData[(csData.EMI >= 3) & (csData.DEVICECOUNT >= 5)].head(5)

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PROCUTAGE_NEW,PRODUCTAGE_NEW2
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2,2
27,F17131,3179.708359,3,6.5,1.100000,Early-bird,2,2
33,G16437,3787.328898,3,6.7,1.000000,Early-bird,2,2
36,G18402,3402.199381,3,6.5,1.000000,Early-bird,2,2
40,H16326,3988.935304,3,6.5,0.900000,Early-bird,1,1

In [25]:
csData[["CUSTID","AVERAGEPRICE","EMI","DEVICECOUNT"]].head()

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT
0  A13566   4273.900000    3          6.4
1  A14219   3642.441950    2          4.0
2  A15312   3653.884565    2          5.0
3  A16605   3713.211107    2          6.6
4  B10634   3391.074215    2          4.2

#### 컬럼별 형변환

In [4]:
csData.dtypes

CUSTID           object
AVERAGEPRICE    float64
EMI               int64
DEVICECOUNT     float64
PRODUCTAGE      float64
CUSTTYPE         object
dtype: object

In [5]:
custidColNo = csData.columns.get_loc("CUSTID")
custidColNo

0

#### numpy_01 ; 원하는 조건을 가진 컬럼 생성하기

In [6]:
# numpy 이용해서 새로운 컬럼 생성하기
# \은 가독성을 위해 코드상 줄띄움하려고,,

csData["PROCUTAGE_NEW"] = np.where(csData["PRODUCTAGE"]<1,1,\
                        np.where(csData["PRODUCTAGE"]<2,2,\
                        np.where(csData["PRODUCTAGE"]<3,3,\
                                                        5)))
csData.head()

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PROCUTAGE_NEW
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3

In [15]:
csData.head()

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PROCUTAGE_NEW
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3

#### numpy_02 ; 다른 방식으로

In [11]:
def refining(df):
    if df["PRODUCTAGE"] < 1:
        return 1
    elif df["PRODUCTAGE"] < 2:
        return 2
    else:
        return 5

In [18]:
len(csData.apply(refining,axis=1))

150

In [19]:
csData["PRODUCTAGE_NEW2"] = csData.apply(refining, axis=1)

In [20]:
csData.head()

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PROCUTAGE_NEW,PRODUCTAGE_NEW2
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2,2
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3,5
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5,5
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1,1
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3,5

### 다른 데이터로 해볼까요 ~

In [27]:
customerData = pd.read_csv("../dataset/kopo_customerdata.csv")
#customerData[["CUSTOMERCODE", 'STATENAME', 'GENDER', 'TOTAL_AMOUNT']].head()
customerData.head()

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0

#### 원하는 행, 열을 '인덱스'로 조회하기

In [28]:
# [:] 은 모든 값을 뜻함. iloc = index location

dfc1 = customerData.iloc[0:3,0:2]
dfc1.head()

   CUSTOMERCODE STATENAME
0       1503989    State2
1       1190338    State2
2       1424715    State2

#### 컬럼 인덱스 컨트롤

In [30]:
# 컬럼의 열 인덱스 확인하고 변수에 넣기 (컬럼명 바꿨을 때에 코드를 전부 바꿀 필요가 없어짐)

csCodeColNo = customerData.columns.get_loc("CUSTOMERCODE")
print(csCodeColNo)
stColNo = customerData.columns.get_loc("ST")
print(stColNo)

0
2

In [31]:
# 안덱싱한 컬럼 변수 활용해 원하는 컬럼만 조회하기

customerData.iloc[0:4,[csCodeColNo,stColNo]]

   CUSTOMERCODE  ST
0       1503989   2
1       1190338   2
2       1424715   2
3       2483305   2

#### kopo_customerdata 테이블에서 0~5번째 행의 statename, gender를 선택하세요 (인덱스 활용)

In [42]:
ind1 = customerData.columns.get_loc("STATENAME")
ind2 = customerData.columns.get_loc("GENDER")
dfc2.iloc[0:5,[ind1,ind2]]

  STATENAME  GENDER
0    State2    Male
1    State2    Male
2    State2  Female
3    State2    Male
4    State2    Male